docs/troubleshooting/user-cart/k6-load-test-2025-11-22/load-test.txt
2025-11-22 11:30:46.046 | 
2025-11-22 11:30:46.046 |          /\      Grafana   /‾‾/  
2025-11-22 11:30:46.046 |     /\  /  \     |\  __   /  /   
2025-11-22 11:30:46.046 |    /  \/    \    | |/ /  /   ‾‾\ 
2025-11-22 11:30:46.046 |   /          \   |   (  |  (‾)  |
2025-11-22 11:30:46.046 |  / __________ \  |_|\_\  \_____/ 
2025-11-22 11:30:46.046 | 
2025-11-22 11:30:46.176 |      execution: local
2025-11-22 11:30:46.176 |         script: /scripts/user-cart/load-test.js
2025-11-22 11:30:46.176 |         output: -
2025-11-22 11:30:46.176 | 
2025-11-22 11:30:46.176 |      scenarios: (100.00%) 1 scenario, 3 max VUs, 5m30s max duration (incl. graceful stop):
2025-11-22 11:30:46.176 |               * main: 10 iterations for each of 3 VUs (maxDuration: 5m0s, gracefulStop: 30s)
2025-11-22 11:30:46.176 | 
2025-11-22 11:30:47.177 | 
2025-11-22 11:30:47.177 | running (0m00.8s), 3/3 VUs, 0 complete and 0 interrupted iterations
2025-11-22 11:30:47.177 | main   [   0% ] 3 VUs  0m00.1s/5m0s  00/30 iters, 10 per VU
2025-11-22 11:30:48.176 | 
2025-11-22 11:30:48.176 | running (0m01.8s), 3/3 VUs, 0 complete and 0 interrupted iterations
2025-11-22 11:30:48.176 | main   [   0% ] 3 VUs  0m01.1s/5m0s  00/30 iters, 10 per VU
2025-11-22 11:30:49.177 | 
2025-11-22 11:30:49.177 | running (0m02.8s), 3/3 VUs, 1 complete and 0 interrupted iterations
2025-11-22 11:30:49.177 | main   [   3% ] 3 VUs  0m02.1s/5m0s  01/30 iters, 10 per VU
2025-11-22 11:30:50.177 | 
2025-11-22 11:30:50.177 | running (0m03.8s), 3/3 VUs, 2 complete and 0 interrupted iterations
2025-11-22 11:30:50.177 | main   [   7% ] 3 VUs  0m03.1s/5m0s  02/30 iters, 10 per VU
2025-11-22 11:30:51.176 | 
2025-11-22 11:30:51.176 | running (0m04.8s), 3/3 VUs, 4 complete and 0 interrupted iterations
2025-11-22 11:30:51.176 | main   [  13% ] 3 VUs  0m04.1s/5m0s  04/30 iters, 10 per VU
2025-11-22 11:30:52.177 | 
2025-11-22 11:30:52.177 | running (0m05.8s), 3/3 VUs, 6 complete and 0 interrupted iterations
2025-11-22 11:30:52.177 | main   [  20% ] 3 VUs  0m05.1s/5m0s  06/30 iters, 10 per VU
2025-11-22 11:30:53.177 | 
2025-11-22 11:30:53.177 | running (0m06.8s), 3/3 VUs, 7 complete and 0 interrupted iterations
2025-11-22 11:30:53.177 | main   [  23% ] 3 VUs  0m06.1s/5m0s  07/30 iters, 10 per VU
2025-11-22 11:30:54.176 | 
2025-11-22 11:30:54.176 | running (0m07.8s), 3/3 VUs, 11 complete and 0 interrupted iterations
2025-11-22 11:30:54.176 | main   [  37% ] 3 VUs  0m07.1s/5m0s  11/30 iters, 10 per VU
2025-11-22 11:30:55.177 | 
2025-11-22 11:30:55.177 | running (0m08.8s), 3/3 VUs, 13 complete and 0 interrupted iterations
2025-11-22 11:30:55.177 | main   [  43% ] 3 VUs  0m08.1s/5m0s  13/30 iters, 10 per VU
2025-11-22 11:30:56.176 | 
2025-11-22 11:30:56.176 | running (0m09.8s), 3/3 VUs, 16 complete and 0 interrupted iterations
2025-11-22 11:30:56.176 | main   [  53% ] 3 VUs  0m09.1s/5m0s  16/30 iters, 10 per VU
2025-11-22 11:30:57.177 | 
2025-11-22 11:30:57.177 | running (0m10.8s), 3/3 VUs, 17 complete and 0 interrupted iterations
2025-11-22 11:30:57.177 | main   [  57% ] 3 VUs  0m10.1s/5m0s  17/30 iters, 10 per VU
2025-11-22 11:30:58.176 | 
2025-11-22 11:30:58.176 | running (0m11.8s), 3/3 VUs, 19 complete and 0 interrupted iterations
2025-11-22 11:30:58.176 | main   [  63% ] 3 VUs  0m11.1s/5m0s  19/30 iters, 10 per VU
2025-11-22 11:30:59.177 | 
2025-11-22 11:30:59.177 | running (0m12.8s), 3/3 VUs, 21 complete and 0 interrupted iterations
2025-11-22 11:30:59.177 | main   [  70% ] 3 VUs  0m12.1s/5m0s  21/30 iters, 10 per VU
2025-11-22 11:31:00.176 | 
2025-11-22 11:31:00.176 | running (0m13.8s), 2/3 VUs, 26 complete and 0 interrupted iterations
2025-11-22 11:31:00.176 | main   [  87% ] 3 VUs  0m13.1s/5m0s  26/30 iters, 10 per VU
2025-11-22 11:31:01.176 | 
2025-11-22 11:31:01.176 | running (0m14.8s), 2/3 VUs, 27 complete and 0 interrupted iterations
2025-11-22 11:31:01.176 | main   [  90% ] 3 VUs  0m14.1s/5m0s  27/30 iters, 10 per VU
2025-11-22 11:31:02.177 | 
2025-11-22 11:31:02.177 | running (0m15.8s), 1/3 VUs, 28 complete and 0 interrupted iterations
2025-11-22 11:31:02.177 | main   [  93% ] 3 VUs  0m15.1s/5m0s  28/30 iters, 10 per VU
2025-11-22 11:31:03.178 | 
2025-11-22 11:31:03.178 | running (0m16.8s), 1/3 VUs, 29 complete and 0 interrupted iterations
2025-11-22 11:31:03.178 | main   [  97% ] 3 VUs  0m16.1s/5m0s  29/30 iters, 10 per VU
2025-11-22 11:31:04.177 | 
2025-11-22 11:31:04.177 | running (0m17.8s), 1/3 VUs, 29 complete and 0 interrupted iterations
2025-11-22 11:31:04.177 | main   [  97% ] 3 VUs  0m17.1s/5m0s  29/30 iters, 10 per VU
2025-11-22 11:31:05.089 | time="2025-11-22T04:31:05Z" level=info msg="cartValidations: {\"VU_1_1763785846339_15074\":null,\"VU_2_1763785846339_15074\":null,\"VU_3_1763785846339_15074\":null}" source=console
2025-11-22 11:31:05.089 | time="2025-11-22T04:31:05Z" level=info msg="availabilitiesValidations: {\"51a64413-746e-4d03-ae6f-4075764a97b2\":null,\"c3d1e80a-678c-4560-8309-e3fded8f008f\":null,\"e706c932-8540-4164-8e90-a1a0c7a636ff\":null,\"f2654ac9-d37d-4801-89f6-b32c36228896\":null,\"f7b2bf24-900d-44a7-a29c-f8bec6a68b53\":null}" source=console
2025-11-22 11:31:05.089 | time="2025-11-22T04:31:05Z" level=info msg="103 - successReservationsByHosts: {\"totalGroups\":{\"http://inventory-service:8083\":50,\"http://inventory-service-1:8083\":46},\"sumTotals\":96}" source=console
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 |   █ TOTAL RESULTS 
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 |     CUSTOM
2025-11-22 11:31:05.097 |     requests_counter...............: 103   5.716481/s
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 |     HTTP
2025-11-22 11:31:05.097 |     http_req_duration..............: avg=152.11ms min=6.91ms  med=72.7ms max=1.46s p(90)=281.52ms p(95)=588.71ms
2025-11-22 11:31:05.097 |       { expected_response:true }...: avg=152.11ms min=6.91ms  med=72.7ms max=1.46s p(90)=281.52ms p(95)=588.71ms
2025-11-22 11:31:05.097 |     http_req_failed................: 0.00% 0 out of 95
2025-11-22 11:31:05.097 |     http_reqs......................: 95    5.272483/s
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 |     EXECUTION
2025-11-22 11:31:05.097 |     iteration_duration.............: avg=1.49s    min=98.88ms med=1.3s   max=3.97s p(90)=2.42s    p(95)=2.84s   
2025-11-22 11:31:05.097 |     iterations.....................: 30    1.664995/s
2025-11-22 11:31:05.097 |     vus............................: 1     min=1       max=3
2025-11-22 11:31:05.097 |     vus_max........................: 3     min=3       max=3
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 |     NETWORK
2025-11-22 11:31:05.097 |     data_received..................: 40 kB 2.2 kB/s
2025-11-22 11:31:05.097 |     data_sent......................: 25 kB 1.4 kB/s
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 | 
2025-11-22 11:31:05.097 | 
[...]
2025-11-22 11:31:05.097 | running (0m18.0s), 0/3 VUs, 30 complete and 0 interrupted iterations
2025-11-22 11:31:05.097 | main ✓ [ 100% ] 3 VUs  0m17.3s/5m0s  30/30 iters, 10 per VU